* Файлы проекта
#+BEGIN_SRC shell
for i in `ls *.lisp` 
do
 echo [[./${i}]]
done
#+END_SRC

#+RESULTS:
| [[file:./approximation.lisp]]   |
| [[file:./gsll-samples.lisp]]    |
| [[file:./las-rotation.lisp]]    |
| [[file:./list-matr.lisp]]       |
| [[file:./lu-solve.lisp]]        |
| [[file:./math.lisp]]            |
| [[file:./matr-class.lisp]]      |
| [[file:./matr-class-temp.lisp]] |
| [[file:./matr.lisp]]            |
| [[file:./mult-matr-vect.lisp]]  |
| [[file:./package.lisp]]         |
| [[file:./statistics.lisp]]      |
| [[file:./test.lisp]]            |
| [[file:./x-o.lisp]]             |
| [[file:./x-o-testing.lisp]]     |


* TODO Разобраться с функциями с целью исключеия какой-либо из них. [0/3]
- [ ] matr-ij (matr i j)
- [ ] matr-set_ij (matr elem i j)
- [ ] matr-set-ij (matr value i j)

** DONE Выполнить оптимизацию вычисления для функции matr-mnk за счет создания матрицы содержащей функции для аддитивного вычисления коэффициентов
   SCHEDULED: <2018-11-30 Пт>

* TODO Определить класс matrix при помощи массива (array 2d) [%]
Файл -  [[./matr-class.lisp]]
Класс - matrix 

Файл -  [[./matr-class-temp.lisp]] - содержит заготовки функций, которые необходимо переделать под класс  matrix.
По окончании пределки функций данный файл подлежит удалению из проекта.

* TODO Определить операции для класса matrix [50%]
- [ ] вывода строки, определяющией тип матрицы    -- matr-name-* (matrix);
- [X] создания матрицы                            -- make-instance 'matrix
- [X] инициализации матрицы                       -- initialize-instance ((mm matrix) &key (rows 3) (cols 3) initial-element initial-contents (element-type t));
- [X] копирования матрицы                         -- matr-copy-* (matrix);
- [X] определения количества:
  + [X] строк                                     -- matr-rows-* (matrix); 
  + [X] столбцов                                  -- matr-cols-* (matrix);
- [X] печати                                      -- print-object (matrix s)
- [-] [75%] извлечения: 
  + [X] элментов;
  + [X] строк;
  + [X] столбцов;
  + [-] [50%] диагонали; 
    - [X] главной   major-diagonal
    - [ ] побочной  minor-diagonal ошибка
- [-] записи:
  + [X] элементов
  + [X] строки
  + [X] столбца
  + [ ] диагонали
    - [ ] главной
    - [ ] побочной
- [ ] Опреции: [0%]
  - [ ] проверки равентсва                        -- matr-equal (matrix1 matrix2);
  - [ ] Сложения
  - [ ] Умножения [0%]
    - [ ] на матрицу
    - [ ] на вектор
    - [ ] на число
- [ ] Преобразования [0%]
  + [ ] в 2d-list
* Определить функции тестирования для матриц



* Скорость выполнения [1/4]

* Рефакторинг

 matr-class.lisp - файл, содержащий определение класса matrix и его функции и методы, он временно исключен;
В данном файле определения функций должны в конце имени иметь "-*";

 x-o.lisp        - файл, содержащий определение класса x-o крестики-нолики, он времено исключен


